import { Reward } from '@/types/Reward.ts';

const rewards: Reward[] = [
    {
        id: 1,
        title: 'Самбо',
        year: 2023,
        rank: 'Кандидат в Мастера спорта',
    },
    {
        id: 2,
        title: 'Дзюдо',
        year: 2023,
        rank: 'Кандидат в Мастера спорта',
    },
    {
        id: 3,
        title: 'Шахматы',
        year: 2020,
        rank: '2 взрослый разряд',
    },
    {
        id: 4,
        title: 'Всероссийская олимпиада школьников по информатике',
        year: 2022,
        rank: 'Выход на региональный этап',
    },
    {
        id: 5,
        title: 'Всероссийская олимпиада школьников по физике',
        year: 2022,
        rank: 'Выход на региональный этап',
    },
    {
        id: 6,
        title: 'Олимпиада КФУ по математике',
        year: 2023,
        rank: 'Диплом 3 степени',
    },
    {
        id: 7,
        title: 'Городская олимпиада по программированию',
        year: 2022,
        rank: 'Диплом 3 степени',
    },
    {
        id: 8,
        title: 'Школьная Волейбольная лига',
        year: 2023,
        rank: 'Выход в региональную стадию соревнования',
    },
    {
        id: 9,
        title: 'Открытый командный кубок Евгения Исаева по самбо',
        year: 2022,
        rank: '2 место',
    }
];

export default rewards;
