import { Hobby } from "@/types/hobby.ts";

const hobbies: Hobby[] = [
    {
        id: 1,
        title: "Шахматы",
        imageUrl: "",
        description: "Занимался около 8 лет. Выполнил 2 взрослый разряд. Участвовал в огромном количестве турниров, много призовых мест."
    },
    {
        id: 2,
        title: "Баскетбол",
        imageUrl: "",
        description: "Не занимался никогда, но очень нравится этот вид спорта, в свободное время играю с друзьями на уличных площадках."
    },
    {
        id: 3,
        title: "Самбо",
        imageUrl: "",
        description: "Занимался 12 лет. Выполнил КМС по самбо и по дзюдо. Участвовал во всех турнирах и соревнованиях, в которых можно было. Огромное количество призовых мест и наград."
    },
    {
        id: 4,
        title: "Автомобили",
        imageUrl: "",
        description: "Нравится любая техника с ДВС, но автомобили особенно. Есть в них что-то особенное..."
    },
    {
        id: 5,
        title: "Волейбол",
        imageUrl: "",
        description: "Занимался около 5 лет в школе. С школьной командой, в которой я был капитаном, участвовали в ШВЛ и достаточно далеко проходили."
    },
    {
        id: 6,
        title: "Программирование",
        imageUrl: "",
        description: "Нравится программировать. В процессе обучения познакомился с множеством языков программирования(Java, Python, C++, Kotlin, JavaScript, PHP)."
    }
];

export default hobbies;